In [1]:
import pandas as pd
import plotly.offline as pyo
import plotly.graph_objects as go
pd.options.plotting.backend = 'plotly'
import string
import nltk
from nltk.tokenize import sent_tokenize, word_tokenize
import collections

In [2]:
data_scientist = pd.read_csv('data-scientist.csv')
data_scientist.head()

,jobId,employerId,employerName,employerProfileId,employerProfileName,jobTitle,locationName,minimumSalary,maximumSalary,currency,expirationDate,date,jobDescription,applications,jobUrl,fullDescription
0,41564639,626228,Aggregator Network,NaN,NaN,Data Science & Machine Learning Research Engineer,Gloucester,NaN,NaN,NaN,24/01/2021,13/12/2020,What is Raytheon's Strategic Research Group (S...,5,https://www.reed.co.uk/jobs/data-science-machi...,<strong>What is Raytheon's Strategic Research ...
1,41665242,610656,The Flowminder Foundation,NaN,NaN,Data Scientist / Mid-Level / Senior Data Scien...,Southampton,56508.0,56508.0,GBP,15/02/2021,04/01/2021,Data Scientist / Mid-Level / Senior Data Scien...,5,https://www.reed.co.uk/jobs/data-scientist-mid...,<strong>Data Scientist / Mid-Level / Senior Da...
2,41725106,331522,Harnham,NaN,NaN,Senior Data Scientist - 5 Months FTC,London,55000.0,60000.0,GBP,22/02/2021,11/01/2021,"SENIOR DATA SCIENTIST &#163;60,000 &#43; BENE...",1,https://www.reed.co.uk/jobs/senior-data-scient...,<p><strong>SENIOR DATA SCIENTIST</strong></p>...
3,41760986,391559,Reqiva Ltd,NaN,NaN,Data Scientist Ordnance Survey Data Contract,Reading,400.0,400.0,GBP,13/02/2021,15/01/2021,* Ordnance Survey Data Experience Required* Py...,3,https://www.reed.co.uk/jobs/data-scientist-ord...,* Ordnance Survey Data Experience Required<br ...
4,41760987,391559,Reqiva Ltd,NaN,NaN,Data Scientist Ordnance Survey Data Contract,Kent,400.0,400.0,GBP,13/02/2021,15/01/2021,* Ordnance Survey Data Experience Required* Py...,0,https://www.reed.co.uk/jobs/data-scientist-ord...,* Ordnance Survey Data Experience Required<br ...

### Top 10 companiesÂ by the most received applications

In [3]:
data_scientist15 = data_scientist.groupby(['employerName'])['applications'].sum().sort_values(ascending = False).nlargest(n=10).reset_index()
data_scientist15

                                    employerName  applications
0                                        Harnham          2198
1                                   PeopleGenius           468
2                             Aggregator Network           299
3                                   Blue Pelican           286
4                                       X4 Group           277
5                      Understanding Recruitment           248
6                                     Data Idols           238
7                                  Corriculo Ltd           152
8                              Vertical Ambition           147
9  Anson McCade Ltd - IT and Finance Recruitment           144

In [4]:
data_scientist15[data_scientist15['employerName'] == 'WhiteHat Group']['applications'].sum()

0

### Top 10 companies by the most listed jobs

In [5]:
data_scientist16 = data_scientist['employerName'].value_counts().sort_values(ascending = False).nlargest(n=10).reset_index()
data_scientist16

                                           index  employerName
0                                        Harnham           215
1                             Aggregator Network            43
2                                       X4 Group            36
3                                     Data Idols            18
4                                   PeopleGenius            16
5                     Sphere Digital Recruitment            15
6                                   Blue Pelican            14
7                      Understanding Recruitment            13
8                               Jefferson Frank             12
9  Anson McCade Ltd - IT and Finance Recruitment            12

### The most applications received  for various job positions in companies and locations

In [6]:
data_scientist17 = data_scientist.groupby(['employerName'])['applications'].sum().sort_values(ascending = False).nlargest(n=10).reset_index()
data_scientist17

                                    employerName  applications
0                                        Harnham          2198
1                                   PeopleGenius           468
2                             Aggregator Network           299
3                                   Blue Pelican           286
4                                       X4 Group           277
5                      Understanding Recruitment           248
6                                     Data Idols           238
7                                  Corriculo Ltd           152
8                              Vertical Ambition           147
9  Anson McCade Ltd - IT and Finance Recruitment           144

In [7]:
data_scientist18 = data_scientist.groupby(['locationName'])['applications'].sum().sort_values(ascending = False).nlargest(n=10).reset_index()
data_scientist18

     locationName  applications
0          London          5102
1      Manchester           290
2          Oxford           193
3       Cambridge           180
4         Reading           114
5           Leeds           112
6  Leamington Spa            92
7         Bristol            79
8     Southampton            74
9   Milton Keynes            73

### Maximum average salary of top 10 companies

In [8]:
data_scientist19 = data_scientist.groupby(['employerName'])['maximumSalary'].mean().sort_values(ascending = False).nlargest(n=10).reset_index()
data_scientist19

                  employerName  maximumSalary
0  Reed Specialist Recruitment  110000.000000
1       Eames Consulting Group  100000.000000
2                       Arthur   95000.000000
3    Eden James Consulting Ltd   95000.000000
4                 Zazu Digital   90000.000000
5                      Harnham   86854.651163
6             Amber Resourcing   85000.000000
7   FRG Technology Consulting    83400.000000
8                   Profile 29   80000.000000
9              MFK Recruitment   80000.000000

### Which is the most skills required for a Data Analyst job
First check the most used words in job title and download stopwords for NLP analysis

In [9]:
! pip install nltk
nltk.download('stopwords') 
stopwords = nltk.corpus.stopwords.words('english')

Requirement already satisfied: nltk in c:\users\ghs lab pc\anaconda3\lib\site-packages (3.5)
Requirement already satisfied: regex in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (2020.6.8)
Requirement already satisfied: click in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (7.1.2)
Requirement already satisfied: tqdm in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (4.47.0)
Requirement already satisfied: joblib in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (0.16.0)

[nltk_data] Downloading package stopwords to C:\Users\GHS Lab
[nltk_data]     PC\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

### Set for removal words

In [10]:
remove_words = set(stopwords + list(string.punctuation) + list(string.digits))

### Check the most used words in job title

In [11]:
job_title = data_scientist[data_scientist['jobTitle'] != '-1']['jobTitle'].tolist()
list_of_words = []
for item in job_title:
    content = nltk.word_tokenize(item)
    for word in content:
        # remove unwanted words
       if word.lower() not in remove_words and word.lower() != 'data'and word.lower() != 'analyst' and word.lower() != 'data analyst':
            list_of_words.append(word.upper())

### Conver list into pandas data frame

In [12]:
list_of_words1 = pd.DataFrame({'Job Title': list_of_words}) 
list_of_words1

      Job Title
0       SCIENCE
1       MACHINE
2      LEARNING
3      RESEARCH
4      ENGINEER
...         ...
1743    CLEARED
1744  PRINCIPAL
1745  SCIENTIST
1746         DV
1747    CLEARED

[1748 rows x 1 columns]

### Check unique words in the above job title column

In [13]:
list_of_words1['Job Title'].unique()

array(['SCIENCE', 'MACHINE', 'LEARNING', 'RESEARCH', 'ENGINEER',
       'SCIENTIST', 'MID-LEVEL', 'SENIOR', 'MONTHS', 'FTC', 'ORDNANCE',
       'SURVEY', 'CONTRACT', 'LEAD', 'BIOINFORMATICS', 'NGS', 'CHINESE',
       'MANDARIN', 'SPEAKING', 'VISUALISATION', 'PYTHON', 'DEFENCE',
       'CONSULTANT', 'NLP', 'FULLY-REMOTE', 'ASSET', 'MANAGEMENT',
       'GAMING/', 'BETTING', 'SQL', 'FULLY', 'REMOTE', 'RESEARCHER',
       'RECOMMENDATION', 'SYSTEMS', 'MARTECH', 'START', 'COMPUTER',
       'VISION', 'X3', 'POSITIONS', 'FINANCE', 'TECHNOLOGY', 'PRINCIPAL',
       'FRONT', 'END', 'DEVELOPER', 'ANALYTICS', 'DIRECTOR', 'DIGITAL',
       '6M', 'PORTFOLIO', 'RISK', 'SENIOR/', 'HEAD', 'PRODUCT', 'JUNIOR',
       'GRADUATE', 'MEDICAL', 'SCIENTIST/', 'MARKETING', 'TOP', 'AGENCY',
       'CREDIT', 'DECISIONING', 'CREDIT/', 'LENDING', 'ECOMMERCE', 'PART',
       'QUANT', 'QUANTITATIVE', 'BUSINESS', 'SCIENTIST-', 'LEADING',
       'TRADING', 'FIRM', 'LONDON-', 'HEDGE', 'FUND', 'ANALYST/JUNIOR',
       'INTERNSHIP', 'PERMANENT', 'POSITION', 'MANAGER', 'ONLINE',
       'ENTERTAINMENT', 'ASENIOR', 'LABORATORY', 'PLATFORM', 'Â£55,000',
       'DV', 'SC', 'BPSS', 'CLEARED', 'MANCHESTER', 'WORK', 'AVAILABLE',
       'INSURANCE', 'PRICING', 'ADVANCED', 'EDINBURGH', 'NATWEST',
       'GROUP', 'CAREERS', 'NATO', 'QUANTAMENTAL', 'EQUITY',
       'CAUSALITY-FOCUSED', 'FINTECH', 'SYSTEMATIC', 'LEAD/HEAD', 'WEST',
       'SUSSEX', 'STATISTICAL', 'MODELLER', 'BRD', 'LARGE', 'MIGRATION',
       'PROJECT', 'NORTH', 'EAST', 'RWE', 'BIOTECH', 'JUNIOR/GRADUATE',
       'BI', 'MATHS', 'STATS', '35-50K', 'ML', 'PURE', 'PLAY', 'MARKET',
       'LEADER', 'DEVELOPER/', 'MONTH', 'TECH', 'Â£55K', 'SNR', 'HELSINKI',
       'FINNISH', 'LONDON', 'TEAM', 'PROGRAMMATIC', 'LOND', 'ETL', 'HR',
       'ML/NLP', 'COMMERCIAL', 'ECONOMETRICS', 'FORECASTING', 'CAUSAL',
       'INFERENCE', 'CONTRACTOR', 'R', 'CUSTOMER', 'AI', 'CNN', '12',
       'FIXED', 'TERM', 'READING', 'HALIFAX', 'CRM', 'LOCUM',
       'MICROBIOLOGY', 'BIOMEDICAL', 'JOB', 'LEAMINGTON', 'SPA',
       'HERTFORDSHIRE', 'LIFE', 'SCIENCES', 'BILINGUAL', 'EMA', 'EU',
       'LANGUAGES'], dtype=object)

### Count the top 20 most used words

In [14]:
data_scientist20 = list_of_words1['Job Title'].value_counts().sort_values(ascending = False).nlargest(n=20).reset_index()
data_scientist20

         index  Job Title
0    SCIENTIST        659
1       SENIOR        166
2      SCIENCE         62
3         LEAD         55
4    PRINCIPAL         36
5       PYTHON         27
6     CONTRACT         27
7     LEARNING         24
8      MACHINE         24
9          NLP         24
10      REMOTE         19
11    ENGINEER         18
12        HEAD         17
13   ANALYTICS         15
14     PRICING         14
15       QUANT         13
16      JUNIOR         13
17    GRADUATE         11
18    RESEARCH          9
19  MANAGEMENT          9

### Next check the most listed skills in the main data frame job title column
#### To extract name entity recognition from all job titles and save in a dictionary

In [15]:
!pip3 install https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz
import spacy
nlp = spacy.load('en_core_web_sm')

name_entity_recognition_job_title = {}

for item in job_title:
    token = nlp(item)
    for ent in token.ents:      
        name_entity_recognition_job_title.setdefault(ent.label_ , []).append(ent.text)

Collecting https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz
  Downloading https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz (12.0 MB)
Requirement already satisfied (use --upgrade to upgrade): en-core-web-sm==2.3.1 from https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz in c:\users\ghs lab pc\anaconda3\lib\site-packages
Requirement already satisfied: spacy<2.4.0,>=2.3.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from en-core-web-sm==2.3.1) (2.3.5)
Requirement already satisfied: thinc<7.5.0,>=7.4.1 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (7.4.5)
Requirement already satisfied: catalogue<1.1.0,>=0.0.7 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.0.0)
Requirement already satisfied: setuptools in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (49.2.0.post20200714)
Requirement already satisfied: requests<3.0.0,>=2.13.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2.24.0)
Requirement already satisfied: plac<1.2.0,>=0.9.6 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.1.3)
Requirement already satisfied: tqdm<5.0.0,>=4.38.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (4.47.0)
Requirement already satisfied: preshed<3.1.0,>=3.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (3.0.5)
Requirement already satisfied: blis<0.8.0,>=0.4.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (0.7.4)
Requirement already satisfied: murmurhash<1.1.0,>=0.28.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.0.5)
Requirement already satisfied: srsly<1.1.0,>=1.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.0.5)
Requirement already satisfied: numpy>=1.15.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.18.5)
Requirement already satisfied: cymem<2.1.0,>=2.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2.0.5)
Requirement already satisfied: wasabi<1.1.0,>=0.4.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (0.8.2)
Requirement already satisfied: idna<3,>=2.5 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2.10)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2020.6.20)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.25.9)
Requirement already satisfied: chardet<4,>=3.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (3.0.4)
Building wheels for collected packages: en-core-web-sm
  Building wheel for en-core-web-sm (setup.py): started
  Building wheel for en-core-web-sm (setup.py): finished with status 'done'
  Created wheel for en-core-web-sm: filename=en_core_web_sm-2.3.1-py3-none-any.whl size=12047114 sha256=d0d2062e7c054ab1e6bfc8db8de73633d57cb44e1820bd8aea6d03572ae2bf0a
  Stored in directory: c:\users\ghs lab pc\appdata\local\pip\cache\wheels\ee\4d\f7\563214122be1540b5f9197b52cb3ddb9c4a8070808b22d5a84
Successfully built en-core-web-sm

In [16]:
name_entity_recognition_job_title.keys()

dict_keys(['ORG', 'DATE', 'PERSON', 'NORP', 'LANGUAGE', 'PRODUCT', 'GPE'])

In [17]:
collections.Counter(name_entity_recognition_job_title['ORG']).most_common()

[('Data Scientist Ordnance Survey Data', 6),
 ('Computer Vision', 6),
 ('Data Scientist - eCommerce Analytics - Part Remote', 6),
 ('Data Scientist / Mid-Level /', 4),
 ('Data Analyst', 4),
 ('Data Visualisation', 4),
 ('Machine Learning', 4),
 ('NLP', 4),
 ('Data Engineer - Data Science', 4),
 ('Data Science & Machine Learning Research', 3),
 ('Data Scientist - Python', 3),
 ('SQL - Fully', 3),
 ('Machine Learning Researcher', 3),
 ('Data Scientist / Machine Learning Engineer - Martech', 3),
 ('Data Scientist - Digital Analytics', 3),
 ('Portfolio Risk Management', 3),
 ('Data Scientist Medical,', 3),
 ('Analyst / Data Scientist-', 3),
 ('Analyst / Data Scientist - London- Hedge Fund', 3),
 ('Data Analyst / Data Scientist', 3),
 ('Analyst/Junior Data Scientist', 3),
 ('Data Scientist / Data Analyst', 3),
 ('Laboratory Data Scientist', 2),
 ('DV', 2),
 ('SC', 2),
 ('BPSS', 2),
 ('Advanced Analytics', 2),
 ('Data Scientist - Hedge Fund', 2),
 ('NatWest Group', 2),
 ('Data Scientist- Systematic Quant Fund', 2),
 ('RWE Data Scientist', 2),
 ('Junior/Graduate Data Scientist', 2),
 ('SQL', 2),
 ('CNN', 2),
 ('Locum Microbiology Biomedical', 2),
 ('Data Scientist - Life Sciences', 2),
 ('EMA', 2),
 ('Analytics & Data Science Director', 1),
 ('Marketing & Data Science Director - Top Research Agency', 1)]

In [18]:
collections.Counter(name_entity_recognition_job_title['PERSON']).most_common()

[('Lead Data Scientist', 25),
 ('Data Scientist', 12),
 ('Data Scientist/', 3),
 ('Data Science - Lead/', 2),
 ('Causal Inference - Contract', 2),
 ('Lead Developer', 2)]

In [19]:
collections.Counter(name_entity_recognition_job_title['DATE']).most_common(10)

[('35-50k', 4),
 ('5 Months', 3),
 ('3 month', 2),
 ('5 Month', 2),
 ('12 month', 2)]

In [20]:
collections.Counter(name_entity_recognition_job_title['NORP']).most_common(10)

[('Chinese', 4), ('Finnish', 2)]

In [23]:
collections.Counter(name_entity_recognition_job_title['LANGUAGE']).most_common(10)

[('Mandarin', 4)]

### By viewing above, there are some useful technology skills are mentioned in the job title column
Create list of these skills

In [ ]:
list_of_useful_words = ['PYTHON', 'NLP', 'SQL']

### Next I check how many times the above skills are mentioned in the job title colum

In [ ]:
count_skills_word = []
for word in list_of_words:
    if word in list_of_useful_words:
        count_skills_word.append(word)

In [ ]:
list_of_words2 = pd.DataFrame({'Job Title': count_skills_word}) 
list_of_words2

In [ ]:
list_of_words2['Job Title'].unique()

In [ ]:
data_scientist21 = list_of_words2['Job Title'].value_counts().sort_values(ascending = False).nlargest(n=20).reset_index()
data_scientist21